In [6]:
from pyspark.sql import SparkSession

In [7]:
spark=SparkSession.builder.appName("DataframeExample").getOrCreate()

In [8]:
spark

In [9]:
df_pyspark=spark.read.\
option('header','true').option('inferSchema',True).\
csv('C:/Users/ganes/OneDrive/Documents/pyspark/sample.csv')

In [10]:
df_pyspark.printSchema()

root
 |-- Name: string (nullable = true)
 |-- Age: integer (nullable = true)
 |-- Experience: integer (nullable = true)

In [11]:
df_spark=spark.read.csv('C:/Users/ganes/OneDrive/Documents/pyspark/sample.csv' \
                        ,header=True, inferSchema=True)

In [12]:
df_pyspark.printSchema()

root
 |-- Name: string (nullable = true)
 |-- Age: integer (nullable = true)
 |-- Experience: integer (nullable = true)

In [13]:
df_spark.show()

+---------+---+----------+
|     Name|Age|Experience|
+---------+---+----------+
|    Krish| 31|        10|
|Sudhanshu| 30|         8|
|    Sunny| 29|         4|
+---------+---+----------+

In [14]:
type(df_spark)

pyspark.sql.dataframe.DataFrame

In [15]:
df_spark.columns

['Name', 'Age', 'Experience']

In [16]:
df_spark.head(3)

[Row(Name='Krish', Age=31, Experience=10),
 Row(Name='Sudhanshu', Age=30, Experience=8),
 Row(Name='Sunny', Age=29, Experience=4)]

In [17]:
df_spark.select('Name').show()

+---------+
|     Name|
+---------+
|    Krish|
|Sudhanshu|
|    Sunny|
+---------+

In [18]:
df_spark.select(['Name','Age']).show()

+---------+---+
|     Name|Age|
+---------+---+
|    Krish| 31|
|Sudhanshu| 30|
|    Sunny| 29|
+---------+---+

In [19]:
df_pyspark['Name']

Column<'Name'>

In [20]:
df_spark.dtypes

[('Name', 'string'), ('Age', 'int'), ('Experience', 'int')]

df_spark.describe().show()

In [21]:
df_pyspark.describe().show()

+-------+-----+----+-----------------+
|summary| Name| Age|       Experience|
+-------+-----+----+-----------------+
|  count|    3|   3|                3|
|   mean| null|30.0|7.333333333333333|
| stddev| null| 1.0|3.055050463303893|
|    min|Krish|  29|                4|
|    max|Sunny|  31|               10|
+-------+-----+----+-----------------+

In [22]:
###Adding column

In [25]:
sc=df_pyspark.withColumn('Experience after 2 years',df_pyspark['Experience']+2)

In [26]:
sc.show()

+---------+---+----------+------------------------+
|     Name|Age|Experience|Experience after 2 years|
+---------+---+----------+------------------------+
|    Krish| 31|        10|                      12|
|Sudhanshu| 30|         8|                      10|
|    Sunny| 29|         4|                       6|
+---------+---+----------+------------------------+

In [27]:
###Drop the column

sc1=sc.drop('Experience after 2 years')
sc1.show()

+---------+---+----------+
|     Name|Age|Experience|
+---------+---+----------+
|    Krish| 31|        10|
|Sudhanshu| 30|         8|
|    Sunny| 29|         4|
+---------+---+----------+

In [28]:
##reanming column

sc1.withColumnRenamed('Name','New Name').show()

+---------+---+----------+
| New Name|Age|Experience|
+---------+---+----------+
|    Krish| 31|        10|
|Sudhanshu| 30|         8|
|    Sunny| 29|         4|
+---------+---+----------+

In [31]:
df1=spark.read.format("csv").option("header",True)\
.option("inferSchema",True).option("path","sample1.csv").load()

In [32]:
df1.show()

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
| Ganesh|  28|         3| 50000|
|shankar|  31|         2| 30000|
|   Ramu|  26|         8| 50000|
|   Babu|  25|         9| 35000|
| Dinesh|  24|         1| 20000|
| Sekhar|  28|        10| 10000|
|  Pandu|  38|         6| 60000|
|   Nagu|  40|         9| 70000|
|    Sai|  41|         8| 36000|
| Chandi|null|      null| 40000|
|   null|null|         2|  null|
|   null|  34|         3| 38000|
|   null|  16|      null|  null|
+-------+----+----------+------+

In [33]:
df1.na.drop().show()

+-------+---+----------+------+
|   Name|Age|Experience|Salary|
+-------+---+----------+------+
| Ganesh| 28|         3| 50000|
|shankar| 31|         2| 30000|
|   Ramu| 26|         8| 50000|
|   Babu| 25|         9| 35000|
| Dinesh| 24|         1| 20000|
| Sekhar| 28|        10| 10000|
|  Pandu| 38|         6| 60000|
|   Nagu| 40|         9| 70000|
|    Sai| 41|         8| 36000|
+-------+---+----------+------+

In [34]:
df1.na.drop(how='any').show()

+-------+---+----------+------+
|   Name|Age|Experience|Salary|
+-------+---+----------+------+
| Ganesh| 28|         3| 50000|
|shankar| 31|         2| 30000|
|   Ramu| 26|         8| 50000|
|   Babu| 25|         9| 35000|
| Dinesh| 24|         1| 20000|
| Sekhar| 28|        10| 10000|
|  Pandu| 38|         6| 60000|
|   Nagu| 40|         9| 70000|
|    Sai| 41|         8| 36000|
+-------+---+----------+------+

In [35]:
df1.na.drop(how='all').show()

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
| Ganesh|  28|         3| 50000|
|shankar|  31|         2| 30000|
|   Ramu|  26|         8| 50000|
|   Babu|  25|         9| 35000|
| Dinesh|  24|         1| 20000|
| Sekhar|  28|        10| 10000|
|  Pandu|  38|         6| 60000|
|   Nagu|  40|         9| 70000|
|    Sai|  41|         8| 36000|
| Chandi|null|      null| 40000|
|   null|null|         2|  null|
|   null|  34|         3| 38000|
|   null|  16|      null|  null|
+-------+----+----------+------+

Signature:
df1.na.drop(
    how: str = 'any',
    thresh: Optional[int] = None,
    subset: Union[str, Tuple[str, ...], List[str], NoneType] = None,
) -> pyspark.sql.dataframe.DataFrame
Docstring:
Returns a new :class:`DataFrame` omitting rows with null values.
:func:`DataFrame.dropna` and :func:`DataFrameNaFunctions.drop` are aliases of each other.

.. versionadded:: 1.3.1

Parameters
----------
how : str, optional
    'any' or 'all'.
    If 'any', drop a row if it contains any nulls.
    If 'all', drop a row only if all its values are null.
thresh: int, optional
    default None
    If specified, drop rows that have less than `thresh` non-null values.
    This overwrites the `how` parameter.
subset : str, tuple or list, optional
    optional list of column names to consider.

Examples
--------
>>> df4.na.drop().show()
+---+------+-----+
|age|height| name|
+---+------+-----+
| 10|    80|Alice|
+---+------+-----+
File:      c:\users\ganes\anaconda3\lib\site-packages\pyspark\sql\dataframe.py
Type:      method

In [41]:
df1.na.drop(how='any',thresh=2).show()\
#removes rows with lessthan 2 non null values

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
| Ganesh|  28|         3| 50000|
|shankar|  31|         2| 30000|
|   Ramu|  26|         8| 50000|
|   Babu|  25|         9| 35000|
| Dinesh|  24|         1| 20000|
| Sekhar|  28|        10| 10000|
|  Pandu|  38|         6| 60000|
|   Nagu|  40|         9| 70000|
|    Sai|  41|         8| 36000|
| Chandi|null|      null| 40000|
|   null|  34|         3| 38000|
+-------+----+----------+------+

In [42]:
df1.na.drop(how='any',subset=['Experience']).show()
#if experience column having nulls it will remove the row

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
| Ganesh|  28|         3| 50000|
|shankar|  31|         2| 30000|
|   Ramu|  26|         8| 50000|
|   Babu|  25|         9| 35000|
| Dinesh|  24|         1| 20000|
| Sekhar|  28|        10| 10000|
|  Pandu|  38|         6| 60000|
|   Nagu|  40|         9| 70000|
|    Sai|  41|         8| 36000|
|   null|null|         2|  null|
|   null|  34|         3| 38000|
+-------+----+----------+------+

Signature:
df1.na.fill(
    value: Union[ForwardRef('LiteralType'), Dict[str, ForwardRef('LiteralType')]],
    subset: Optional[List[str]] = None,
) -> pyspark.sql.dataframe.DataFrame
Docstring:
Replace null values, alias for ``na.fill()``.
:func:`DataFrame.fillna` and :func:`DataFrameNaFunctions.fill` are aliases of each other.

.. versionadded:: 1.3.1

Parameters
----------
value : int, float, string, bool or dict
    Value to replace null values with.
    If the value is a dict, then `subset` is ignored and `value` must be a mapping
    from column name (string) to replacement value. The replacement value must be
    an int, float, boolean, or string.
subset : str, tuple or list, optional
    optional list of column names to consider.
    Columns specified in subset that do not have matching data type are ignored.
    For example, if `value` is a string, and subset contains a non-string column,
    then the non-string column is simply ignored.

Examples
--------
>>> df4.na.fill(50).show()
+---+------+-----+
|age|height| name|
+---+------+-----+
| 10|    80|Alice|
|  5|    50|  Bob|
| 50|    50|  Tom|
| 50|    50| null|
+---+------+-----+

>>> df5.na.fill(False).show()
+----+-------+-----+
| age|   name|  spy|
+----+-------+-----+
|  10|  Alice|false|
|   5|    Bob|false|
|null|Mallory| true|
+----+-------+-----+

>>> df4.na.fill({'age': 50, 'name': 'unknown'}).show()
+---+------+-------+
|age|height|   name|
+---+------+-------+
| 10|    80|  Alice|
|  5|  null|    Bob|
| 50|  null|    Tom|
| 50|  null|unknown|
+---+------+-------+
File:      c:\users\ganes\anaconda3\lib\site-packages\pyspark\sql\dataframe.py
Type:      method

In [ ]:
#filling missing values

In [49]:
df1.na.fill(value='missing value').show()

+-------------+----+----------+------+
|         Name| Age|Experience|Salary|
+-------------+----+----------+------+
|       Ganesh|  28|         3| 50000|
|      shankar|  31|         2| 30000|
|         Ramu|  26|         8| 50000|
|         Babu|  25|         9| 35000|
|       Dinesh|  24|         1| 20000|
|       Sekhar|  28|        10| 10000|
|        Pandu|  38|         6| 60000|
|         Nagu|  40|         9| 70000|
|          Sai|  41|         8| 36000|
|       Chandi|null|      null| 40000|
|missing value|null|         2|  null|
|missing value|  34|         3| 38000|
|missing value|  16|      null|  null|
+-------------+----+----------+------+

In [54]:
df1.na.fill(0,['Age','Experience']).show()

+-------+---+----------+------+
|   Name|Age|Experience|Salary|
+-------+---+----------+------+
| Ganesh| 28|         3| 50000|
|shankar| 31|         2| 30000|
|   Ramu| 26|         8| 50000|
|   Babu| 25|         9| 35000|
| Dinesh| 24|         1| 20000|
| Sekhar| 28|        10| 10000|
|  Pandu| 38|         6| 60000|
|   Nagu| 40|         9| 70000|
|    Sai| 41|         8| 36000|
| Chandi|  0|         0| 40000|
|   null|  0|         2|  null|
|   null| 34|         3| 38000|
|   null| 16|         0|  null|
+-------+---+----------+------+

In [55]:
df1.show()

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
| Ganesh|  28|         3| 50000|
|shankar|  31|         2| 30000|
|   Ramu|  26|         8| 50000|
|   Babu|  25|         9| 35000|
| Dinesh|  24|         1| 20000|
| Sekhar|  28|        10| 10000|
|  Pandu|  38|         6| 60000|
|   Nagu|  40|         9| 70000|
|    Sai|  41|         8| 36000|
| Chandi|null|      null| 40000|
|   null|null|         2|  null|
|   null|  34|         3| 38000|
|   null|  16|      null|  null|
+-------+----+----------+------+

In [56]:
from pyspark.ml.feature import Imputer

imputer =Imputer(
    inputCols=['Age','Experience','Salary'],
    outputCols=["{}_imputed".format(c)\
                for c in ['Age','Experience','Salary']]
).setStrategy("mean")

In [66]:

df2=imputer.fit(df1).transform(df1)

##filter

In [77]:
df3=df2.na.drop(how='any')

In [81]:
#drop multiple columns
df4=df3.drop(*['Age','Experience','Salary'])

In [82]:
##rename multiple columns
df5=df4.withColumnRenamed('Age_imputed','Age').\
withColumnRenamed('Experience_imputed','Experience').\
withColumnRenamed('Salary_imputed','Salary')

In [85]:
df5.show()

+-------+---+----------+------+
|   Name|Age|Experience|Salary|
+-------+---+----------+------+
| Ganesh| 28|         3| 50000|
|shankar| 31|         2| 30000|
|   Ramu| 26|         8| 50000|
|   Babu| 25|         9| 35000|
| Dinesh| 24|         1| 20000|
| Sekhar| 28|        10| 10000|
|  Pandu| 38|         6| 60000|
|   Nagu| 40|         9| 70000|
|    Sai| 41|         8| 36000|
+-------+---+----------+------+

In [89]:
df5.filter("Salary>50000").show()

+-----+---+----------+------+
| Name|Age|Experience|Salary|
+-----+---+----------+------+
|Pandu| 38|         6| 60000|
| Nagu| 40|         9| 70000|
+-----+---+----------+------+

In [90]:
df5.filter("Salary>50000").select(['Name','Age']).show()

+-----+---+
| Name|Age|
+-----+---+
|Pandu| 38|
| Nagu| 40|
+-----+---+

In [94]:
df5.filter("Salary>30000 and age <30").select(['Name','Age']).show()

+------+---+
|  Name|Age|
+------+---+
|Ganesh| 28|
|  Ramu| 26|
|  Babu| 25|
+------+---+

In [97]:
df5.withColumn("department",("Data science","IOT","Data science","Big Data","IOT"\
                                 "Data Science","Big Data","IOT","Data science")).show()

TypeError: col should be Column

In [99]:
df6=spark.read.format("csv").option("header",True).\
option("inferSchema",True).\
option("path","sample2.csv").load()

In [100]:
df6.show()

+-------+------------+------+
|   Name|  Department|Salary|
+-------+------------+------+
| Ganesh|Data science| 50000|
|shankar|    Big Data| 30000|
|   Ramu|         IOT| 50000|
|   Babu|    Big Data| 35000|
| Dinesh|         IOT| 20000|
| Sekhar|Data science| 10000|
|  Pandu|         IOT| 60000|
|   Nagu|Data science| 70000|
|    Sai|    Big Data| 36000|
| Chandi|Data science| 40000|
+-------+------------+------+

In [108]:
df6.createOrReplaceTempView("employee")

In [114]:
spark.sql("""select Department,count(2) from employee where Salary>20000 
group by Department""").show()

+------------+--------+
|  Department|count(2)|
+------------+--------+
|         IOT|       2|
|Data science|       3|
|    Big Data|       3|
+------------+--------+

In [120]:
df6.groupBy('Department').sum('Salary').show()

+------------+-----------+
|  Department|sum(Salary)|
+------------+-----------+
|         IOT|     130000|
|Data science|     170000|
|    Big Data|     101000|
+------------+-----------+

In [121]:
df6.groupBy('Department').mean('Salary').show()

+------------+------------------+
|  Department|       avg(Salary)|
+------------+------------------+
|         IOT|43333.333333333336|
|Data science|           42500.0|
|    Big Data|33666.666666666664|
+------------+------------------+

In [123]:
df6.agg({'salary':'sum'}).show()

+-----------+
|sum(salary)|
+-----------+
|     401000|
+-----------+

In [124]:
df5.show()

+-------+---+----------+------+
|   Name|Age|Experience|Salary|
+-------+---+----------+------+
| Ganesh| 28|         3| 50000|
|shankar| 31|         2| 30000|
|   Ramu| 26|         8| 50000|
|   Babu| 25|         9| 35000|
| Dinesh| 24|         1| 20000|
| Sekhar| 28|        10| 10000|
|  Pandu| 38|         6| 60000|
|   Nagu| 40|         9| 70000|
|    Sai| 41|         8| 36000|
+-------+---+----------+------+

#MLib

In [125]:
df5.printSchema()

root
 |-- Name: string (nullable = true)
 |-- Age: integer (nullable = true)
 |-- Experience: integer (nullable = true)
 |-- Salary: integer (nullable = true)

In [127]:
df5.columns

['Name', 'Age', 'Experience', 'Salary']

In [ ]:
[Age,Experience]----> new feature -------->independent feature

In [128]:
from pyspark.ml.feature import VectorAssembler

In [130]:
featureAssembler=VectorAssembler(inputCols=["Age","Experience"],outputCol="independent feature")

In [132]:
output=featureAssembler.transform(df5) #df5 will be training dataset

In [133]:
output.show()

+-------+---+----------+------+-------------------+
|   Name|Age|Experience|Salary|independent feature|
+-------+---+----------+------+-------------------+
| Ganesh| 28|         3| 50000|         [28.0,3.0]|
|shankar| 31|         2| 30000|         [31.0,2.0]|
|   Ramu| 26|         8| 50000|         [26.0,8.0]|
|   Babu| 25|         9| 35000|         [25.0,9.0]|
| Dinesh| 24|         1| 20000|         [24.0,1.0]|
| Sekhar| 28|        10| 10000|        [28.0,10.0]|
|  Pandu| 38|         6| 60000|         [38.0,6.0]|
|   Nagu| 40|         9| 70000|         [40.0,9.0]|
|    Sai| 41|         8| 36000|         [41.0,8.0]|
+-------+---+----------+------+-------------------+

In [134]:
output.columns

['Name', 'Age', 'Experience', 'Salary', 'independent feature']

In [135]:
finalised_data=output.select("independent feature","Salary")

In [136]:
finalised_data.show()

+-------------------+------+
|independent feature|Salary|
+-------------------+------+
|         [28.0,3.0]| 50000|
|         [31.0,2.0]| 30000|
|         [26.0,8.0]| 50000|
|         [25.0,9.0]| 35000|
|         [24.0,1.0]| 20000|
|        [28.0,10.0]| 10000|
|         [38.0,6.0]| 60000|
|         [40.0,9.0]| 70000|
|         [41.0,8.0]| 36000|
+-------------------+------+

In [137]:
from pyspark.ml.regression import LinearRegression

In [146]:
##train test split
train_data,test_data=finalised_data.randomSplit([0.65,0.35])
regressor=LinearRegression(featuresCol='independent feature', labelCol='Salary')
regressor=regressor.fit(train_data)

In [147]:
regressor.coefficients

DenseVector([2600.424, -269.0127])

In [148]:
regressor.intercept

-36942.810818070495

In [149]:
train_data.show()

+-------------------+------+
|independent feature|Salary|
+-------------------+------+
|         [24.0,1.0]| 20000|
|         [26.0,8.0]| 50000|
|         [28.0,3.0]| 50000|
|        [28.0,10.0]| 10000|
|         [31.0,2.0]| 30000|
|         [38.0,6.0]| 60000|
|         [40.0,9.0]| 70000|
+-------------------+------+

In [150]:
test_data.show()

+-------------------+------+
|independent feature|Salary|
+-------------------+------+
|         [25.0,9.0]| 35000|
|         [41.0,8.0]| 36000|
+-------------------+------+

In [151]:
pred_results=regressor.evaluate(test_data)

In [152]:
pred_results.predictions.show()

+-------------------+------+------------------+
|independent feature|Salary|        prediction|
+-------------------+------+------------------+
|         [25.0,9.0]| 35000|25646.676196598157|
|         [41.0,8.0]| 36000| 67522.47368875484|
+-------------------+------+------------------+

In [153]:
pred_results.meanAbsoluteError,pred_results.meanSquaredError

(20437.89874607834, 540575506.8147621)